Revit 2026 API

# MetalMetalType Property

---

The property labeled "Type" from the "Metal" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetalType { get; }
```
```vb
Public Shared ReadOnly Property MetalType As String
	Get
```
```cpp
public:
static property String^ MetalType {
	String^ get ();
}
```
```fsharp
static member MetalType : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetalType".

#### Reference

Metal Class

Autodesk.Revit.DB.Visual Namespace